zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
/**********************************************************
	Module converter

	Converter settings are shared between global settings
	and profiles. Converter is initialized to some known
	default state which is safe. Then global settings and profiles can be loaded.
	On power off, data that came from global set. must be saved back
	as well as profile data.

**********************************************************/



#include <string.h>

#include "MDR32Fx.h" 

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"


//#include "sound_driver.h"
#include "control.h"
#include "converter.h"
#include "converter_hw.h"
#include "adc.h"
#include "eeprom.h"

#include "dispatcher.h"



enum ChargeFSMCommands { START_CHARGE = 1, STOP_CHARGE, ABORT_CHARGE, CHARGE_TICK };





// OS stuff
xQueueHandle xQueueConverter;
xTaskHandle xTaskHandle_Converter;
const converter_message_t converter_overload_msg = {CONVERTER_OVERLOADED};
const converter_message_t converter_tick_message = {CONVERTER_TICK};

// Global to allow whole message processing be split into several functions
static converter_message_t msg;

uint32_t adc_msg;
dispatch_msg_t dispatcher_msg;

converter_state_t converter_state;		// main converter control
//dac_settings_t dac_settings;			// DAC calibration offset

static void Converter_ProcessStateControl (uint8_t cmd_code);
static void Converter_ProcessParamControl (void);
static void Converter_ProcessProfile (void);
static uint8_t Converter_ProcessCharge(uint8_t cmd);


//---------------------------------------------//
// 

uint8_t Converter_GetState(void)
{
	return (converter_state.state == CONVERTER_STATE_ON) ? 1 : 0;
}

uint16_t Converter_GetVoltageSetting(uint8_t channel)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
    return c->voltage.setting;
}

uint16_t Converter_GetVoltageAbsMax(uint8_t channel)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
    return c->voltage.MAXIMUM;
}

uint16_t Converter_GetVoltageAbsMin(uint8_t channel)
{
    channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
    return c->voltage.MINIMUM;
}

uint16_t Converter_GetVoltageLimitSetting(uint8_t channel, uint8_t limit_type)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
    return (limit_type == LIMIT_TYPE_LOW) ? c->voltage.limit_low : c->voltage.limit_high;
}

uint8_t Converter_GetVoltageLimitState(uint8_t channel, uint8_t limit_type)
{
    channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
    return (limit_type == LIMIT_TYPE_LOW) ? c->voltage.enable_low_limit : c->voltage.enable_high_limit;
}

uint16_t Converter_GetCurrentSetting(uint8_t channel, uint8_t range)
{
    channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
    return s->setting;
}

uint16_t Converter_GetCurrentAbsMax(uint8_t channel, uint8_t range)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
    return s->MAXIMUM;
}

uint16_t Converter_GetCurrentAbsMin(uint8_t channel, uint8_t range)
{
    channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
    return s->MINIMUM;
}

uint16_t Converter_GetCurrentLimitSetting(uint8_t channel, uint8_t range, uint8_t limit_type)
{
    channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
	return (limit_type == LIMIT_TYPE_LOW) ? s->limit_low : s->limit_high;
}

uint8_t Converter_GetCurrentLimitState(uint8_t channel, uint8_t range, uint8_t limit_type)
{
    channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
	return (limit_type == LIMIT_TYPE_LOW) ? s->enable_low_limit : s->enable_high_limit;
}

uint8_t Converter_GetOverloadProtectionState(void)
{
	return converter_state.overload_protection_enable;
}

uint8_t Converter_GetOverloadProtectionWarning(void)
{
    return converter_state.overload_warning_enable;
}

uint16_t Converter_GetOverloadProtectionThreshold(void)
{
	// return value is in units of 100us
    return converter_state.overload_threshold;	
}

uint8_t Converter_GetCurrentRange(uint8_t channel)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
    return c->current->RANGE;
}

uint8_t Converter_GetFeedbackChannel(void)
{
	return converter_state.channel->CHANNEL;
}


int8_t Converter_GetVoltageDacOffset(void)
{
	return global_settings->dac_voltage_offset;
}

int8_t Converter_GetCurrentDacOffset(uint8_t range)
{
	return (range == CURRENT_RANGE_LOW) ? global_settings->dac_current_low_offset : global_settings->dac_current_high_offset;
}


//---------------------------------------------//






//---------------------------------------------------------------------------//
///	Checks and sets new value in regulation structure
//---------------------------------------------------------------------------//
static uint8_t SetRegulationValue(reg_setting_t *s, int32_t new_value)
{
	uint8_t errCode = 0;
	// Check software limits
	if ((s->enable_low_limit) && (new_value <= (int32_t)s->limit_low)) {	
		new_value = (int32_t)s->limit_low;
		errCode |= VALUE_BOUND_BY_SOFT_MIN;
	}
	if ((s->enable_high_limit) && (new_value >= (int32_t)s->limit_high)) {
		new_value = (int32_t)s->limit_high;
		errCode |= VALUE_BOUND_BY_SOFT_MAX;
	} 
	// Check absolute limits
	if (new_value <= (int32_t)s->MINIMUM) {	
		new_value = (int32_t)s->MINIMUM;
		errCode |= VALUE_BOUND_BY_ABS_MIN;
	}
	if (new_value >= (int32_t)s->MAXIMUM) {
		new_value = (int32_t)s->MAXIMUM;
		errCode |= VALUE_BOUND_BY_ABS_MAX;
	} 
	// Check if new value differes from old
	if (s->setting != new_value) {
		s->setting = new_value;
		errCode |= VALUE_UPDATED;
	}
	return errCode;
}


//---------------------------------------------------------------------------//
///	Checks and sets new value limit in regultaion structure
//---------------------------------------------------------------------------//
static uint8_t SetRegulationLimit(reg_setting_t *s, uint8_t limit_type, int32_t new_value, uint8_t enable)
{
	uint8_t errCode = 0;
	if (new_value <= (int32_t)s->LIMIT_MIN)
	{	
		new_value = (int32_t)s->LIMIT_MIN;
		errCode |= VALUE_BOUND_BY_ABS_MIN;
	}
	if (new_value >= (int32_t)s->LIMIT_MAX) 
	{
		new_value = (int32_t)s->LIMIT_MAX;
		errCode |= VALUE_BOUND_BY_ABS_MAX;
	} 
	if (limit_type == LIMIT_TYPE_LOW)
	{
		if ((s->limit_low != new_value) || (s->enable_low_limit != enable))
		{
			s->limit_low = new_value;
			s->enable_low_limit = enable;
			errCode |= VALUE_UPDATED;
		}
	}
	else 
	{
		if ((s->limit_high != new_value) || (s->enable_high_limit != enable))
		{
			s->limit_high = new_value;
			s->enable_high_limit = enable;
			errCode |= VALUE_UPDATED;
		}
	}
	return errCode;
}


//---------------------------------------------------------------------------//
///	Set converter output voltage
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V
//		new_value - new value to check and set
//	output:
//		err_code - return code providing information about 
//				   limiting new value by absolute and software limits
//---------------------------------------------------------------------------//
static uint8_t Converter_SetVoltage(uint8_t channel, int32_t new_value)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	uint8_t err_code = SetRegulationValue(&c->voltage, new_value);
	return err_code;
}


//---------------------------------------------------------------------------//
///	Set converter voltage limit
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V
//		limit_type - low or high limit to modify
//		new_value - new value to check and set
//		enable - set limit enabled or disabled
//	output:
//		err_code - return code providing information about 
//				   limiting new value by absolute limits
//---------------------------------------------------------------------------//
static uint8_t Converter_SetVoltageLimit(uint8_t channel, uint8_t limit_type, int32_t new_value, uint8_t enable)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	uint8_t err_code = SetRegulationLimit(&c->voltage, limit_type, new_value, enable);
	// Ensure that voltage setting lies inside new limits
	Converter_SetVoltage(channel, c->voltage.setting);
	return err_code;
}


//---------------------------------------------------------------------------//
///	Set converter output current
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V
//		current_range - 20A range or 40A range to modify.
//		new_value - new value to check and set
//	output:
//		err_code - return code providing information about 
//				   limiting new value by absolute and software limits
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrent(uint8_t channel, uint8_t current_range, int32_t new_value)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (current_range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
	uint8_t err_code = SetRegulationValue(s, new_value);
	return 	err_code;
}


//---------------------------------------------------------------------------//
/// Set converter current limit
//	input:
//		channel - converter channel to affect: CHANNEL_5V / CHANNEL_12V
//		current_range - 20A range or 40A range to modify.
//		limit_type - low or high limit to modify
//		new_value - new value to check and set
//		enable - set limit enabled or disabled
//	output:
//		err_code - return code providing information about 
//				   limiting new value by absolute limits
//---------------------------------------------------------------------------//
static uint8_t Converter_SetCurrentLimit(uint8_t channel, uint8_t current_range, uint8_t limit_type, int32_t new_value, uint8_t enable)
{
	channel_state_t *c = (channel == CHANNEL_5V) ? &converter_state.channel_5v : &converter_state.channel_12v;
	reg_setting_t *s = (current_range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
	uint8_t err_code = SetRegulationLimit(s, limit_type, new_value, enable);	
	// Ensure that current setting lies inside new limits
	Converter_SetCurrent(channel, current_range, s->setting);
	return err_code;
}


//---------------------------------------------------------------------------//
/// Set converter overload parameters
// new_threshold in units of 100us
//---------------------------------------------------------------------------//
static uint8_t Converter_SetOverloadProtection(uint8_t protectionEnable, uint8_t warningEnable, int32_t new_threshold)
{
	uint8_t err_code;
	if (new_threshold < CONV_MIN_OVERLOAD_THRESHOLD)
	{
		new_threshold = CONV_MIN_OVERLOAD_THRESHOLD;
		err_code = VALUE_BOUND_BY_ABS_MIN;
	}
	else if (new_threshold > CONV_MAX_OVERLOAD_THRESHOLD)
	{
		new_threshold = CONV_MAX_OVERLOAD_THRESHOLD;
		err_code = VALUE_BOUND_BY_ABS_MAX;
	}
	else
	{
		err_code = VALUE_UPDATED;
	}
	
