zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
	converter_state.overload_protection_enable = protectionEnable;
	converter_state.overload_warning_enable = warningEnable;
	converter_state.overload_threshold = new_threshold;
	return err_code;
}	


//---------------------------------------------------------------------------//
//	If *channel = OPERATING_CHANNEL (special case), 
//	functions modifies channel to currently operating.
//---------------------------------------------------------------------------//
static uint8_t Converter_ValidateChannel(uint8_t channel)
{
	if ((channel != CHANNEL_5V) && (channel != CHANNEL_12V))
		channel = converter_state.channel->CHANNEL;	// OPERATING_CHANNEL
	return channel;
}


//---------------------------------------------------------------------------//
//	If *range = OPERATING_RANGE (special case), 
//	functions modifies range to currently operating.
//---------------------------------------------------------------------------//
static uint8_t Converter_ValidateCurrentRange(uint8_t range)
{
	if ((range != CURRENT_RANGE_LOW) && (range != CURRENT_RANGE_HIGH))
		range = converter_state.channel->current->RANGE;	//OPERATING_CURRENT_RANGE	
	return range;
}




//===========================================================================//
//===========================================================================//

// Converter data is shared between hardcoded constants and 
// profile data which is loaded from EEPROM

static void Converter_LoadProfile(void)
{
	//---------- Channel 5V ------------//
	// Voltage
	converter_state.channel_5v.voltage.setting = device_profile->converter_profile.ch5v_voltage.setting;
	converter_state.channel_5v.voltage.limit_low = device_profile->converter_profile.ch5v_voltage.limit_low;
	converter_state.channel_5v.voltage.limit_high = device_profile->converter_profile.ch5v_voltage.limit_high;
	converter_state.channel_5v.voltage.enable_low_limit = device_profile->converter_profile.ch5v_voltage.enable_low_limit;
	converter_state.channel_5v.voltage.enable_high_limit = device_profile->converter_profile.ch5v_voltage.enable_high_limit;
	// Current low range
	converter_state.channel_5v.current_low_range.setting = device_profile->converter_profile.ch5v_current.low_range.setting;
	converter_state.channel_5v.current_low_range.limit_low = device_profile->converter_profile.ch5v_current.low_range.limit_low;
	converter_state.channel_5v.current_low_range.limit_high = device_profile->converter_profile.ch5v_current.low_range.limit_high;
	converter_state.channel_5v.current_low_range.enable_low_limit = device_profile->converter_profile.ch5v_current.low_range.enable_low_limit;
	converter_state.channel_5v.current_low_range.enable_high_limit = device_profile->converter_profile.ch5v_current.low_range.enable_high_limit;
	// Current high range
	converter_state.channel_5v.current_high_range.setting = device_profile->converter_profile.ch5v_current.high_range.setting;
	converter_state.channel_5v.current_high_range.limit_low = device_profile->converter_profile.ch5v_current.high_range.limit_low;
	converter_state.channel_5v.current_high_range.limit_high = device_profile->converter_profile.ch5v_current.high_range.limit_high;
	converter_state.channel_5v.current_high_range.enable_low_limit = device_profile->converter_profile.ch5v_current.high_range.enable_low_limit;
	converter_state.channel_5v.current_high_range.enable_high_limit = device_profile->converter_profile.ch5v_current.high_range.enable_high_limit;
	// Apply current range
	converter_state.channel_5v.current = (device_profile->converter_profile.ch5v_current.selected_range == CURRENT_RANGE_LOW) ? 
		&converter_state.channel_5v.current_low_range : &converter_state.channel_5v.current_high_range;
	
	
	//---------- Channel 12V -----------//
	// Voltage
	converter_state.channel_12v.voltage.setting = device_profile->converter_profile.ch12v_voltage.setting;
	converter_state.channel_12v.voltage.limit_low = device_profile->converter_profile.ch12v_voltage.limit_low;
	converter_state.channel_12v.voltage.limit_high = device_profile->converter_profile.ch12v_voltage.limit_high;
	converter_state.channel_12v.voltage.enable_low_limit = device_profile->converter_profile.ch12v_voltage.enable_low_limit;
	converter_state.channel_12v.voltage.enable_high_limit = device_profile->converter_profile.ch12v_voltage.enable_high_limit;
	// Current low range
	converter_state.channel_12v.current_low_range.setting = device_profile->converter_profile.ch12v_current.low_range.setting;
	converter_state.channel_12v.current_low_range.limit_low = device_profile->converter_profile.ch12v_current.low_range.limit_low;
	converter_state.channel_12v.current_low_range.limit_high = device_profile->converter_profile.ch12v_current.low_range.limit_high;
	converter_state.channel_12v.current_low_range.enable_low_limit = device_profile->converter_profile.ch12v_current.low_range.enable_low_limit;
	converter_state.channel_12v.current_low_range.enable_high_limit = device_profile->converter_profile.ch12v_current.low_range.enable_high_limit;
	// Current high range
	converter_state.channel_12v.current_high_range.setting = device_profile->converter_profile.ch12v_current.high_range.setting;
	converter_state.channel_12v.current_high_range.limit_low = device_profile->converter_profile.ch12v_current.high_range.limit_low;
	converter_state.channel_12v.current_high_range.limit_high = device_profile->converter_profile.ch12v_current.high_range.limit_high;
	converter_state.channel_12v.current_high_range.enable_low_limit = device_profile->converter_profile.ch12v_current.high_range.enable_low_limit;
	converter_state.channel_12v.current_high_range.enable_high_limit = device_profile->converter_profile.ch12v_current.high_range.enable_high_limit;
	// Apply current range
	converter_state.channel_12v.current = (device_profile->converter_profile.ch12v_current.selected_range == CURRENT_RANGE_LOW) ? 
		&converter_state.channel_12v.current_low_range : &converter_state.channel_12v.current_high_range;
		
