zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/source/src/converter.c
//---------------------------------------------//
//	Main converter task
//	
//---------------------------------------------//
void vTaskConverter(void *pvParameters) 
{	
	// Initialize
	xQueueConverter = xQueueCreate( 5, sizeof( converter_message_t ) );
	if( xQueueConverter == 0 )
		while(1);
	
	// Wait until task is started by dispatcher		
	//vTaskSuspend(0);
	
	xQueueReset(xQueueConverter);
	while(1) {
		xQueueReceive(xQueueConverter, &msg, portMAX_DELAY);	
		switch (msg.type) {
			case CONVERTER_CONTROL:
				if (msg.param == param_STATE)
					Converter_ProcessStateControl(msg.a.state_set.command);
				else
					Converter_ProcessParamControl();
				break;
			case CONVERTER_PROFILE_CMD:
				Converter_ProcessProfile();
				break;
			case CONVERTER_ADC_MEASUREMENT_READY:

				break;
			case CONVERTER_TICK:
				Converter_ProcessStateControl(event_TICK);
				break;
			case CONVERTER_OVERLOAD_EVENT:
				Converter_ProcessStateControl(event_OVERLOAD);
				break;
			default:	// unknown
				break;
		}
	}
}	
		
		

//=========================================================================//
//	Control command processor
//=========================================================================//
static void Converter_ProcessStateControl (uint8_t cmd_code) {
	uint8_t err_code = ERROR_NONE;
	uint8_t state_event = CONV_NO_STATE_CHANGE;
	uint8_t temp8u;
	
	switch (cmd_code) {
		case cmd_GET_READY_FOR_CHANNEL_SWITCH:
		case cmd_GET_READY_FOR_PROFILE_LOAD:
			if (converter_state.state == CONVERTER_STATE_ON) {
				Converter_TurnOff();
				converter_state.state = CONVERTER_STATE_OFF;
				stateResponse(0, ERROR_NONE, CONV_TURNED_OFF);				
			}
			else if (converter_state.state == CONVERTER_STATE_CHARGING)	{
				// Stop charge FSM
				Converter_TurnOff();
				SetOutputLoad(converter_state.channel->load_state);
				converter_state.state = CONVERTER_STATE_OFF;
				Converter_ProcessCharge(STOP_CHARGE);
				stateResponse(0, ERROR_NONE, CONV_ABORTED_CHARGE);
			}
			else if (converter_state.state == CONVERTER_STATE_OVERLOADED) {
				// Just reset flag
				converter_state.state = CONVERTER_STATE_OFF;
				// stateResponse(ERROR_NONE, CONV_RESET_OVERLOAD_FLAG);		CHECKME
			}
			else {
				// OFF - do nothing
			}
			break;
		case cmd_TURN_ON:
			if ((converter_state.state == CONVERTER_STATE_OFF) || (converter_state.state == CONVERTER_STATE_OVERLOADED)) {
				// Resistive output load could be disabled by charger - enable it
				SetOutputLoad(converter_state.channel->load_state);
				// Command to low-level
				temp8u = Converter_TurnOn();
				if (temp8u == CONVERTER_CMD_OK) {
					converter_state.state = CONVERTER_STATE_ON;
					state_event = CONV_TURNED_ON;
				} 
				else {
					err_code = ERROR_INTERNAL;
				}
				msgConfirm(&msg);
				stateResponse(&msg, err_code, state_event);
			} else {
				msgConfirm(&msg);	// Converter is already ON or CHARGING - only give semaphore
			}
			break;
		case cmd_START_CHARGE:
			if (converter_state.state != CONVERTER_STATE_CHARGING) {
				if (converter_state.channel->CHANNEL == CHANNEL_12V) {				
					if (converter_state.state != CONVERTER_STATE_ON) {
						// Command to low-level
						temp8u = Converter_TurnOn();
						if (temp8u != CONVERTER_CMD_OK) {
							err_code = ERROR_INTERNAL;
						}
					}
					if (err_code == ERROR_NONE) {
						// Resistive output load must be disabled
						SetOutputLoad(0);
						// Process charge FSM
						Converter_ProcessCharge(START_CHARGE);
						converter_state.state = CONVERTER_STATE_CHARGING;
						state_event = CONV_STARTED_CHARGE;
					}
				}
				else {
					// Can charge only by 12V channel
					err_code = ERROR_CMD;	
				}
			}
			else {
				// CHARGING already - restart?
			}
			msgConfirm(&msg);
			stateResponse(&msg, err_code, state_event);
			break;
		case cmd_TURN_OFF:
			temp8u = converter_state.state;
			Converter_TurnOff();
			converter_state.state = CONVERTER_STATE_OFF;
			if (temp8u == CONVERTER_STATE_CHARGING) {
				Converter_ProcessCharge(STOP_CHARGE);
				state_event = CONV_ABORTED_CHARGE;
			} else {
				// Resistive output load was disabled by charger and it is second STOP command - enable it
				SetOutputLoad(converter_state.channel->load_state);
				state_event = CONV_TURNED_OFF;
			}
			msgConfirm(&msg);
			stateResponse(&msg, err_code, state_event);
			break;
		case event_OVERLOAD:
			// Hardware has been overloaded and disabled by low-level interrupt-driven routine.
			temp8u = converter_state.state;
			converter_state.state = CONVERTER_STATE_OVERLOADED;
			// Reset that routine FSM flag
			if (Converter_ClearOverloadFlag() != CONVERTER_CMD_OK) {
				// Error, we should never get here.
				// Kind of restore attempt
				Converter_TurnOff();
				err_code = ERROR_INTERNAL;
			}
			stateResponse(0, err_code, CONV_OVERLOADED);
			if (temp8u == CONVERTER_STATE_CHARGING) {
				// Stop charge FSM
				Converter_ProcessCharge(STOP_CHARGE);
				stateResponse(0, ERROR_NONE, CONV_ABORTED_CHARGE);
				// Do not enable resistive load here
			}			
			break;
		case event_TICK:		// Temporary! Will be special for charging mode
			// ADC task is responsible for sampling and filtering voltage and current
			adc_msg = ADC_GET_ALL_NORMAL;
			xQueueSendToBack(xQueueADC, &adc_msg, 0);
			break;
	}
}


//=========================================================================//
//	Parameters setting processor
//=========================================================================//
static void Converter_ProcessParamControl (void)
{
	uint8_t err_code = ERROR_NONE;
	uint8_t op_result = 0;
	uint8_t temp8u;
	channel_state_t *c;
	switch (msg.param) {
		//-------------------- Setting voltage --------------------//
		case param_VSET:
			msg.a.v_set.channel = Converter_ValidateChannel(msg.a.v_set.channel);
			taskENTER_CRITICAL();
			op_result = Converter_SetVoltage(msg.a.v_set.channel, msg.a.v_set.value);
			taskEXIT_CRITICAL();
			// Apply new setting to hardware. CHECKME: charge state
			if ((op_result & VALUE_UPDATED) && (msg.a.v_set.channel == converter_state.channel->CHANNEL)) {
				SetVoltageDAC(converter_state.channel->voltage.setting);
			}
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_VSET);
			dispatcher_msg.converter_event.channel = msg.a.v_set.channel;
			dispatcher_msg.converter_event.spec = op_result;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break;	
		//-------------------- Setting current --------------------//
		case param_CSET:
			msg.a.c_set.channel = Converter_ValidateChannel(msg.a.c_set.channel);
			msg.a.c_set.range = Converter_ValidateCurrentRange(msg.a.c_set.range);
			taskENTER_CRITICAL();
			op_result = Converter_SetCurrent(msg.a.c_set.channel, msg.a.c_set.range, msg.a.c_set.value);
			taskEXIT_CRITICAL();
			// Apply new setting to hardware. CHECKME: charge state
			if ((op_result & VALUE_UPDATED) && (msg.a.c_set.channel == converter_state.channel->CHANNEL) && 
				(msg.a.c_set.range == converter_state.channel->current->RANGE))	{
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
			}
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_CSET);
			dispatcher_msg.converter_event.channel = msg.a.c_set.channel;
			dispatcher_msg.converter_event.range = msg.a.c_set.range;
			dispatcher_msg.converter_event.spec = op_result;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break;
		//----------------- Setting voltage limit -----------------//
		case param_VLIMIT:
			msg.a.vlim_set.channel = Converter_ValidateChannel(msg.a.vlim_set.channel);
			taskENTER_CRITICAL();
			op_result = Converter_SetVoltageLimit(msg.a.vlim_set.channel, msg.a.vlim_set.type, 
								msg.a.vlim_set.value, msg.a.vlim_set.enable);
			taskEXIT_CRITICAL();
			// Apply new setting to hardware. CHECKME: charge state				
			if ((op_result & VALUE_UPDATED) && (msg.a.vlim_set.channel == converter_state.channel->CHANNEL)) {
				SetVoltageDAC(converter_state.channel->voltage.setting);
			}
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_VLIMIT);
			dispatcher_msg.converter_event.channel = msg.a.vlim_set.channel;
			dispatcher_msg.converter_event.limit_type = msg.a.vlim_set.type;
			dispatcher_msg.converter_event.spec = op_result;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break; 
		//----------------- Setting current limit -----------------//
		case param_CLIMIT:
			msg.a.clim_set.channel = Converter_ValidateChannel(msg.a.clim_set.channel);
			msg.a.clim_set.range = Converter_ValidateCurrentRange(msg.a.clim_set.range);		
			taskENTER_CRITICAL();			
			op_result = Converter_SetCurrentLimit(msg.a.clim_set.channel, msg.a.clim_set.range, msg.a.clim_set.type, 
								msg.a.clim_set.value, msg.a.clim_set.enable);
			taskEXIT_CRITICAL();
			// Apply new setting to hardware. CHECKME: charge state	
			if ((op_result & VALUE_UPDATED) && (msg.a.clim_set.channel == converter_state.channel->CHANNEL) && 
				(msg.a.clim_set.range == converter_state.channel->current->RANGE)) {
				SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
			}
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_CLIMIT);
			dispatcher_msg.converter_event.channel = msg.a.clim_set.channel;
			dispatcher_msg.converter_event.range = msg.a.clim_set.range;
			dispatcher_msg.converter_event.limit_type = msg.a.clim_set.type;
			dispatcher_msg.converter_event.spec = op_result;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break; 
		//-------------------- Setting channel --------------------//
		case param_CHANNEL:
			msg.a.ch_set.new_channel = Converter_ValidateChannel(msg.a.ch_set.new_channel);
			if (msg.a.ch_set.new_channel != converter_state.channel->CHANNEL)
			{
				// Disable converter if enabled
				Converter_ProcessStateControl(cmd_GET_READY_FOR_CHANNEL_SWITCH);
				// Wait until voltage feedback switching is allowed
				while(Converter_IsReady() == 0) 
					vTaskDelay(1);
				// Apply new channel setting to hardware
				temp8u = Converter_SetFeedBackChannel(msg.a.ch_set.new_channel);
				if (temp8u == CONVERTER_CMD_OK)	{
					taskENTER_CRITICAL();	
					converter_state.channel = (msg.a.ch_set.new_channel == CHANNEL_5V) ? &converter_state.channel_5v : 
											&converter_state.channel_12v;
					taskEXIT_CRITICAL();
					while(Converter_IsReady() == 0) 
						vTaskDelay(1);	
					// Apply new channel current range setting to hardware
					temp8u = Converter_SetCurrentRange(converter_state.channel->current->RANGE);
					op_result = VALUE_UPDATED;
					if (temp8u == CONVERTER_CMD_OK) {
						SetVoltageDAC(converter_state.channel->voltage.setting);
						SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
						SetOutputLoad(converter_state.channel->load_state);
					} else {
						// Unexpected error for current range setting
						err_code = ERROR_INTERNAL;
					} 
				} else {
					// Unexpected error for channel setting
					err_code = ERROR_INTERNAL;
				}
			} else {
				// Trying to set channel that is already selected.
				op_result = VALUE_BOUND_MASK;
			}
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_CHANNEL);
			dispatcher_msg.converter_event.spec = op_result;
			dispatcher_msg.converter_event.err_code = err_code;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break;
		//----------------- Setting current range -----------------//
		case param_CRANGE:
			msg.a.crange_set.channel = Converter_ValidateChannel(msg.a.crange_set.channel);	
			msg.a.crange_set.new_range = Converter_ValidateCurrentRange(msg.a.crange_set.new_range);
			c = (msg.a.crange_set.channel == CHANNEL_5V) ? &converter_state.channel_5v : 
										&converter_state.channel_12v;	
			if (msg.a.crange_set.new_range != c->current->RANGE) {
				// New current range differs from current
				if (msg.a.crange_set.channel == converter_state.channel->CHANNEL) {
					// Setting current range of the active channel
					if ((converter_state.state != CONVERTER_STATE_ON) && (converter_state.state != CONVERTER_STATE_CHARGING)) {
						// Wait until current feedback switching is allowed
						while(Converter_IsReady() == 0) 
							vTaskDelay(1);	
						// Apply new channel current range setting to hardware
						temp8u = Converter_SetCurrentRange(msg.a.crange_set.new_range);
						if (temp8u == CONVERTER_CMD_OK) {
							taskENTER_CRITICAL();
							c->current = (msg.a.crange_set.new_range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
							taskEXIT_CRITICAL();
							SetCurrentDAC(c->current->setting, c->current->RANGE);
							op_result = VALUE_UPDATED;
						} else {
							// Unexpected error
							err_code = ERROR_INTERNAL;
						}
					} else {
						// Converter in ON and current range cannot be changed
						err_code = ERROR_CMD;
					}
				} else {
					// Setting current range of the inactive channel
					taskENTER_CRITICAL();
					c->current = (msg.a.crange_set.new_range == CURRENT_RANGE_LOW) ? &c->current_low_range : &c->current_high_range;
					taskEXIT_CRITICAL();
					op_result = VALUE_UPDATED;
				}
			} else {
				// Trying to set current range that is already selected.
				op_result = VALUE_BOUND_MASK;
			}
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_CRANGE);
			dispatcher_msg.converter_event.channel = msg.a.crange_set.channel;
			dispatcher_msg.converter_event.spec = op_result;
			dispatcher_msg.converter_event.err_code = err_code;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break;
		//-------- Setting overload protection parameters ---------//
		case param_OVERLOAD_PROTECTION:
			taskENTER_CRITICAL();
			op_result = Converter_SetOverloadProtection( msg.a.overload_set.protection_enable, msg.a.overload_set.warning_enable, 
												msg.a.overload_set.threshold);
			taskEXIT_CRITICAL();
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_OVERLOAD_PROTECTION);
			dispatcher_msg.converter_event.spec = op_result;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break; 
		//-------------------- Setting DAC offset -----------------//
		case param_DAC_OFFSET:
			taskENTER_CRITICAL();
			global_settings->dac_voltage_offset = msg.a.dac_set.voltage_offset;
			global_settings->dac_current_low_offset = msg.a.dac_set.current_low_offset;
			global_settings->dac_current_high_offset = msg.a.dac_set.current_high_offset;
			taskEXIT_CRITICAL();
			// Update DAC output
			SetVoltageDAC(converter_state.channel->voltage.setting);
			SetCurrentDAC(converter_state.channel->current->setting, converter_state.channel->current->RANGE);
			msgConfirm(&msg);
			fillDispatchMessage(&msg, &dispatcher_msg, param_DAC_OFFSET);
			dispatcher_msg.converter_event.spec = VALUE_UPDATED;
			xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, 0);
			break;
	}
}


